app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.requester = current_user

    if @rental_request.save